; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-3-8-36)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	package35 - package
	package36 - package
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p0-2 - location
	p1-0 - location
	p2-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s2)
	(at driver3 s1)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s1)
	(empty truck5)
	(at truck6 s0)
	(empty truck6)
	(at truck7 s0)
	(empty truck7)
	(at truck8 s2)
	(empty truck8)
	(at package1 s1)
	(at package2 s2)
	(at package3 s1)
	(at package4 s0)
	(at package5 s2)
	(at package6 s0)
	(at package7 s1)
	(at package8 s1)
	(at package9 s2)
	(at package10 s2)
	(at package11 s1)
	(at package12 s1)
	(at package13 s1)
	(at package14 s0)
	(at package15 s0)
	(at package16 s1)
	(at package17 s0)
	(at package18 s1)
	(at package19 s0)
	(at package20 s2)
	(at package21 s1)
	(at package22 s0)
	(at package23 s2)
	(at package24 s2)
	(at package25 s2)
	(at package26 s0)
	(at package27 s1)
	(at package28 s1)
	(at package29 s0)
	(at package30 s0)
	(at package31 s1)
	(at package32 s1)
	(at package33 s2)
	(at package34 s1)
	(at package35 s1)
	(at package36 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s1 s2)
	(link s2 s1)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s0)
	(at truck1 s1)
	(at truck2 s0)
	(at truck3 s1)
	(at truck4 s0)
	(at truck5 s2)
	(at truck6 s0)
	(at truck8 s2)
	(at package1 s2)
	(at package2 s1)
	(at package3 s1)
	(at package4 s2)
	(at package5 s1)
	(at package6 s2)
	(at package7 s0)
	(at package8 s0)
	(at package9 s1)
	(at package10 s0)
	(at package11 s2)
	(at package12 s1)
	(at package13 s0)
	(at package14 s1)
	(at package15 s0)
	(at package16 s0)
	(at package17 s2)
	(at package18 s0)
	(at package19 s0)
	(at package20 s0)
	(at package22 s0)
	(at package23 s1)
	(at package24 s2)
	(at package25 s2)
	(at package26 s1)
	(at package27 s1)
	(at package28 s2)
	(at package29 s0)
	(at package30 s0)
	(at package31 s1)
	(at package32 s1)
	(at package33 s1)
	(at package34 s1)
	(at package35 s0)
	(at package36 s1)
	))


)

; plan
1. (load-truck s0 package6 truck7)
   deleted: (at package6 s0)
   added: (in package6 truck7)
   goals met: 17 of 45
2. (board-truck driver2 s2 truck3)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 17 of 45
3. (unload-truck s0 package6 truck7)
   deleted: (in package6 truck7)
   added: (at package6 s0)
   goals met: 17 of 45
4. (board-truck driver3 s1 truck5)
   deleted: (at driver3 s1) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 17 of 45
5. (load-truck s2 package9 truck3)
   deleted: (at package9 s2)
   added: (in package9 truck3)
   goals met: 17 of 45
6. (load-truck s2 package5 truck3)
   deleted: (at package5 s2)
   added: (in package5 truck3)
   goals met: 17 of 45
7. (load-truck s2 package36 truck3)
   deleted: (at package36 s2)
   added: (in package36 truck3)
   goals met: 17 of 45
8. (load-truck s2 package33 truck3)
   deleted: (at package33 s2)
   added: (in package33 truck3)
   goals met: 17 of 45
9. (drive-truck driver2 s2 s0 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 17 of 45
10. (load-truck s0 package6 truck3)
   deleted: (at package6 s0)
   added: (in package6 truck3)
   goals met: 17 of 45
11. (drive-truck driver2 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 17 of 45
12. (unload-truck s2 package6 truck3)
   deleted: (in package6 truck3)
   added: (at package6 s2)
   goals met: 18 of 45
13. (load-truck s2 package23 truck3)
   deleted: (at package23 s2)
   added: (in package23 truck3)
   goals met: 18 of 45
14. (drive-truck driver2 s2 s0 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 18 of 45
15. (drive-truck driver2 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 19 of 45
16. (unload-truck s1 package9 truck3)
   deleted: (in package9 truck3)
   added: (at package9 s1)
   goals met: 20 of 45
17. (unload-truck s1 package5 truck3)
   deleted: (in package5 truck3)
   added: (at package5 s1)
   goals met: 21 of 45
18. (drive-truck driver2 s1 s0 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   goals met: 20 of 45
19. (load-truck s0 package4 truck3)
   deleted: (at package4 s0)
   added: (in package4 truck3)
   goals met: 20 of 45
20. (drive-truck driver2 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 20 of 45
21. (unload-truck s2 package4 truck3)
   deleted: (in package4 truck3)
   added: (at package4 s2)
   goals met: 21 of 45
22. (load-truck s2 package20 truck3)
   deleted: (at package20 s2)
   added: (in package20 truck3)
   goals met: 21 of 45
23. (drive-truck driver2 s2 s0 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 21 of 45
24. (load-truck s0 package26 truck3)
   deleted: (at package26 s0)
   added: (in package26 truck3)
   goals met: 21 of 45
25. (drive-truck driver2 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 22 of 45
26. (unload-truck s1 package36 truck3)
   deleted: (in package36 truck3)
   added: (at package36 s1)
   goals met: 23 of 45
27. (unload-truck s1 package33 truck3)
   deleted: (in package33 truck3)
   added: (at package33 s1)
   goals met: 24 of 45
28. (drive-truck driver2 s1 s0 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   goals met: 23 of 45
29. (unload-truck s0 package20 truck3)
   deleted: (in package20 truck3)
   added: (at package20 s0)
   goals met: 24 of 45
30. (load-truck s0 package17 truck3)
   deleted: (at package17 s0)
   added: (in package17 truck3)
   goals met: 24 of 45
31. (drive-truck driver2 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 25 of 45
32. (drive-truck driver2 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 24 of 45
33. (load-truck s2 package2 truck3)
   deleted: (at package2 s2)
   added: (in package2 truck3)
   goals met: 24 of 45
34. (drive-truck driver2 s2 s1 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 25 of 45
35. (unload-truck s1 package26 truck3)
   deleted: (in package26 truck3)
   added: (at package26 s1)
   goals met: 26 of 45
36. (unload-truck s1 package23 truck3)
   deleted: (in package23 truck3)
   added: (at package23 s1)
   goals met: 27 of 45
37. (drive-truck driver2 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 26 of 45
38. (unload-truck s2 package17 truck3)
   deleted: (in package17 truck3)
   added: (at package17 s2)
   goals met: 27 of 45
39. (load-truck s2 package10 truck3)
   deleted: (at package10 s2)
   added: (in package10 truck3)
   goals met: 27 of 45
40. (drive-truck driver2 s2 s0 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 27 of 45
41. (load-truck s0 package14 truck3)
   deleted: (at package14 s0)
   added: (in package14 truck3)
   goals met: 27 of 45
42. (drive-truck driver2 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 28 of 45
43. (unload-truck s1 package2 truck3)
   deleted: (in package2 truck3)
   added: (at package2 s1)
   goals met: 29 of 45
44. (unload-truck s1 package14 truck3)
   deleted: (in package14 truck3)
   added: (at package14 s1)
   goals met: 30 of 45
45. (drive-truck driver2 s1 s0 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   goals met: 29 of 45
46. (unload-truck s0 package10 truck3)
   deleted: (in package10 truck3)
   added: (at package10 s0)
   goals met: 30 of 45
47. (load-truck s1 package8 truck5)
   deleted: (at package8 s1)
   added: (in package8 truck5)
   goals met: 30 of 45
48. (load-truck s1 package7 truck5)
   deleted: (at package7 s1)
   added: (in package7 truck5)
   goals met: 30 of 45
49. (load-truck s1 package35 truck5)
   deleted: (at package35 s1)
   added: (in package35 truck5)
   goals met: 30 of 45
50. (load-truck s1 package28 truck5)
   deleted: (at package28 s1)
   added: (in package28 truck5)
   goals met: 30 of 45
51. (load-truck s1 package18 truck5)
   deleted: (at package18 s1)
   added: (in package18 truck5)
   goals met: 30 of 45
52. (drive-truck driver3 s1 s0 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   goals met: 30 of 45
53. (board-truck driver1 s1 truck2)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 29 of 45
54. (load-truck s1 package16 truck2)
   deleted: (at package16 s1)
   added: (in package16 truck2)
   goals met: 29 of 45
55. (load-truck s1 package13 truck2)
   deleted: (at package13 s1)
   added: (in package13 truck2)
   goals met: 29 of 45
56. (load-truck s1 package11 truck2)
   deleted: (at package11 s1)
   added: (in package11 truck2)
   goals met: 29 of 45
57. (drive-truck driver1 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 30 of 45
58. (unload-truck s0 package16 truck2)
   deleted: (in package16 truck2)
   added: (at package16 s0)
   goals met: 31 of 45
59. (unload-truck s0 package13 truck2)
   deleted: (in package13 truck2)
   added: (at package13 s0)
   goals met: 32 of 45
60. (drive-truck driver1 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 31 of 45
61. (load-truck s1 package1 truck2)
   deleted: (at package1 s1)
   added: (in package1 truck2)
   goals met: 31 of 45
62. (drive-truck driver1 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 31 of 45
63. (unload-truck s2 package11 truck2)
   deleted: (in package11 truck2)
   added: (at package11 s2)
   goals met: 32 of 45
64. (unload-truck s2 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s2)
   goals met: 33 of 45
65. (unload-truck s0 package8 truck5)
   deleted: (in package8 truck5)
   added: (at package8 s0)
   goals met: 34 of 45
66. (unload-truck s0 package7 truck5)
   deleted: (in package7 truck5)
   added: (at package7 s0)
   goals met: 35 of 45
67. (unload-truck s0 package35 truck5)
   deleted: (in package35 truck5)
   added: (at package35 s0)
   goals met: 36 of 45
68. (unload-truck s0 package18 truck5)
   deleted: (in package18 truck5)
   added: (at package18 s0)
   goals met: 37 of 45
69. (drive-truck driver3 s0 s2 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   goals met: 38 of 45
70. (drive-truck driver1 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 39 of 45
71. (disembark-truck driver3 s2 truck5)
   deleted: (driving driver3 truck5)
   added: (at driver3 s2) (empty truck5)
   goals met: 39 of 45
72. (unload-truck s2 package28 truck5)
   deleted: (in package28 truck5)
   added: (at package28 s2)
   goals met: 40 of 45
73. (drive-truck driver1 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 39 of 45
74. (walk driver3 s2 p0-2)
   deleted: (at driver3 s2)
   added: (at driver3 p0-2)
   goals met: 39 of 45
75. (walk driver3 p0-2 s0)
   deleted: (at driver3 p0-2)
   added: (at driver3 s0)
   goals met: 40 of 45
76. (drive-truck driver1 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 40 of 45
77. (disembark-truck driver1 s2 truck2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 40 of 45
78. (board-truck driver1 s2 truck1)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 40 of 45
79. (drive-truck driver1 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 41 of 45
80. (drive-truck driver2 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 41 of 45
81. (disembark-truck driver1 s1 truck1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s1) (empty truck1)
   goals met: 42 of 45
82. (disembark-truck driver2 s2 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s2) (empty truck3)
   goals met: 42 of 45
83. (board-truck driver2 s2 truck2)
   deleted: (at driver2 s2) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 42 of 45
84. (drive-truck driver2 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 43 of 45
85. (walk driver1 s1 p2-1)
   deleted: (at driver1 s1)
   added: (at driver1 p2-1)
   goals met: 42 of 45
86. (disembark-truck driver2 s0 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 43 of 45
87. (walk driver1 p2-1 s2)
   deleted: (at driver1 p2-1)
   added: (at driver1 s2)
   goals met: 43 of 45
88. (board-truck driver1 s2 truck3)
   deleted: (at driver1 s2) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 43 of 45
89. (drive-truck driver1 s2 s1 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 44 of 45
90. (disembark-truck driver1 s1 truck3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s1) (empty truck3)
   goals met: 45 of 45
